InformationRegisters/НастройкиУчетаНДСПриУСНКомитентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДСПриУСНКомитентов</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеНалогообложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортСырьевыхТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортНесырьевыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОСВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяРаспределением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияРаботУслугНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПоПатенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеверсивноеОбложениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДССМежценовойРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Космос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДСВСтранеЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛьготноеНалогообложениеНДСНаУСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиУчетаНДСПриУСНКомитентов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяРегистра = Метаданные.РегистрыСведений.НастройкиУчетаНДСПриУСНКомитентов.Имя;
	
	ТолькоПросмотр = НЕ УправлениеДоступом.ИзменениеРазрешено(РегистрыСведений.НастройкиУчетаНДСПриУСНКомитентов);
	Элементы.ГруппаНалогообложениеИСтавкиНДС.ТолькоПросмотр = ТолькоПросмотр;
	
	КлючЗаписи = Неопределено;
	ЭтоФормаЗаписи = НЕ Параметры.Свойство("Ключ", КлючЗаписи);
	
	Параметры.Свойство("Комитент", Комитент);
	Элементы.Комитент.Видимость = НЕ ЗначениеЗаполнено(Комитент);
	
	Если ЗначениеЗаполнено(Комитент) Тогда
		Заголовок = Заголовок + ": " + Строка(Комитент);
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СкопироватьЗаписьРегистра(Параметры.ЗначениеКопирования);
	Иначе
		ПрочитатьЗаписьРегистра(КлючЗаписи);
	КонецЕсли;
	
	ДатаПредыдущая = ДатаИзменения;
	УчетНДСРФ.ОписаниеЛимитовПримененияСтавокНДС(Элементы, ДатаИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаИзмененияПриИзменении(Элемент)
	
	ДатаИзменения = НачалоМесяца(ДатаИзменения);
	ТекстВопроса  = НСтр("ru = 'Создать новую настройку на %1?'");
	ТекстВопроса  = СтрШаблон(ТекстВопроса, Формат(ДатаИзменения,"ДЛФ=D"));
	ПоказатьВопрос(Новый ОписаниеОповещения("ДатаИзмененияПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомитентПриИзменении(Элемент)
	
	Комитент = Запись.Комитент;
	ПрочитатьЗаписьРегистраПриИзменииРеквизита(, ДатаИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеИсторииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИсторияИзменений" Тогда
		Если Модифицированность Тогда
			ЗадатьВопросФормаМодифицирована("ОткрытьИсториюИзмененийПродолжение");
		Иначе
			ОткрытьИсториюИзменений();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЗаписатьИзменения(Истина) Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьИзменения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ЗадатьВопросФормаМодифицирована(ИмяОповещения)
	
	ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
	Оповещение = Новый ОписаниеОповещения(ИмяОповещения, ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт  
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ПрочитатьЗаписьРегистраПриИзменииРеквизита(, ДатаИзменения);
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ПрочитатьЗаписьРегистраПриИзменииРеквизита(, ДатаИзменения, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьЗаписьРегистра(ЗначениеКопирования)
	
	НастройкиНалоговУчетныхПолитик.СкопироватьУчетнуюПолитику(ЭтотОбъект, ЗначениеКопирования, ИмяРегистра, "Комитент");
	Копирование = Истина;
	Модифицированность = Истина;
		
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьЗаписьРегистра(КлючЗаписи = Неопределено, ПериодЗаписи = Неопределено, СоздатьНовую = Ложь)
	
	ПрочитатьСоздатьЗаписьРегистра(
			ИмяРегистра,
			"Комитент",
			Комитент,
			СоздатьНовую,
			КлючЗаписи,
			ПериодЗаписи); 
		
	Если ЗначениеЗаполнено(Запись.СтавкаНДС) Тогда
		СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СтавкаНДС, "ПеречислениеСтавкаНДС");
	Иначе
		СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЗаписьРегистраПриИзменииРеквизита(КлючЗаписи = Неопределено, ПериодЗаписи = Неопределено, СоздатьНовую = Ложь)
	
	Если НЕ Копирование Тогда
		ПрочитатьЗаписьРегистра(КлючЗаписи, ПериодЗаписи, СоздатьНовую);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПослеЗаписи()
	
	ПараметрыОповещения = Новый Структура("Контрагент, Период", Запись.Комитент, Запись.Период);
	ИмяСобытия = "Запись_" + ИмяРегистра;
	Оповестить(ИмяСобытия, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИзмененияНаСервере(Закрытие = Ложь) 
	
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда  
			Запись.ОсновноеНалогообложение = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			Запись.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		Иначе 
			Запись.ОсновноеНалогообложение = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН;
			Запись.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(СтавкаНДС, Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН);
		КонецЕсли;
	Иначе
		Запись.ОсновноеНалогообложение = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Запись.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка(); 
	КонецЕсли;
	ЗаписьУспешна = ЗаписатьИзменениеЗаписейРегистра(Закрытие);
	
	Возврат ЗаписьУспешна;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьИзменения(Закрытие = Ложь)  
	
	ОчиститьСообщения();
	ЗаписьУспешна = ЗаписатьИзмененияНаСервере(Закрытие);
	Если ЗаписьУспешна Тогда
		ОповеститьПослеЗаписи();
	КонецЕсли;
	
	Возврат ЗаписьУспешна; 
	
КонецФункции

&НаКлиенте
Процедура ОткрытьИсториюИзменений()
	
	ОткрытьФорму("РегистрСведений.НастройкиУчетаНДСПриУСНКомитентов.Форма.РедактированиеИстории",
		Новый Структура("ТолькоПросмотр, Комитент", ТолькоПросмотр, Комитент),
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОткрытьИсториюИзмененийЗавершение", ЭтотОбъект));
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюИзмененийПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ОткрытьИсториюИзменений();
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		Если НЕ ЗаписатьИзменения(Ложь) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюИзмененийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПрочитатьЗаписьРегистра(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСоздатьЗаписьРегистра(ИмяРегистра, ИмяИзмерения, Значение, СоздатьНовую, КлючЗаписи = Неопределено, ПериодЗначений = Неопределено, ДопРеквизиты = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Значение) 
		И ЗначениеЗаполнено(КлючЗаписи) Тогда
		Значение = КлючЗаписи[ИмяИзмерения];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздатьНовую Тогда
		КлючЗаписи = НастройкиНалоговУчетныхПолитик.НовыйКлючЗаписиУчетнойПолитики(ИмяРегистра, Значение, ПериодЗначений, ИмяИзмерения);
	КонецЕсли;
	
	Если КлючЗаписи = Неопределено Тогда
		
		ПериодКлюча = ПериодЗначений;
		Если ЗначениеЗаполнено(ДатаПредыдущая) Тогда
			ПериодКлюча = ДатаПредыдущая;
		КонецЕсли;
		КлючЗаписи = НастройкиНалоговУчетныхПолитик.КлючЗаписиДействующейУчетнойПолитики(ИмяРегистра, Значение, ПериодКлюча, ИмяИзмерения);
	ИначеЕсли ТипЗнч(КлючЗаписи) = Тип("Структура") Тогда
		КлючЗаписи = НастройкиНалоговУчетныхПолитик.НовыйКлючЗаписиУчетнойПолитики(ИмяРегистра, КлючЗаписи[ИмяИзмерения], КлючЗаписи.Период, ИмяИзмерения);
	КонецЕсли;
	
	МенеджерЗаписи = НастройкиНалоговУчетныхПолитик.МенеджерЗаписиПериодическогоРегистра(ИмяРегистра, КлючЗаписи, ИмяИзмерения, Запись);
	
	Если ДопРеквизиты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДопРеквизиты, МенеджерЗаписи);
	КонецЕсли;
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
	Если НЕ ЗначениеЗаполнено(ДатаИзменения) Тогда
		ДатаИзменения = МенеджерЗаписи.Период;
	КонецЕсли;
	
	НастройкиНалоговУчетныхПолитик.ОбновитьОписаниеИстории(ЭтотОбъект, ИмяРегистра, Значение, МенеджерЗаписи.Период, ИмяИзмерения);
	
	Попытка
		РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор); // Разблокируем другие ключи, заблокированные этой формой
		ЗаблокироватьДанныеДляРедактирования(КлючЗаписи,, УникальныйИдентификатор);
	Исключение
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заблокировать запись регистра по %1 - %2 за период %3.
					|%4'"),
			ИмяИзмерения,
			Значение,
			МенеджерЗаписи.Период,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

// Параметры:
// 	Закрытие - Булево - признак закрытия формы после записи.
// 	ДопРеквизиты - Структура - реквизиты регистра недоступные в данных формы.
// 	
// Возвращаемое значение:
// 	Булево - признак успешной записи
//
&НаСервере
Функция ЗаписатьИзменениеЗаписейРегистра(Закрытие = Ложь, ДопРеквизиты = Неопределено)
	
	Отказ = НЕ ПроверитьЗаполнение();
	Если Отказ Тогда
		Возврат НЕ Отказ;
	КонецЕсли;
	
	МенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	МенеджерЗаписи.Период = ДатаИзменения;
	Если ДопРеквизиты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДопРеквизиты);
	КонецЕсли;
	МенеджерЗаписи.Записать(НЕ ЭтоФормаЗаписи);
	Модифицированность = Ложь;
	
	ДатаПредыдущая = МенеджерЗаписи.Период;
	
	Если НЕ Закрытие Тогда
		ПрочитатьСоздатьЗаписьРегистра(ИмяРегистра, "Комитент", Комитент, Ложь, Неопределено, МенеджерЗаписи.Период, ДопРеквизиты);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти
